[
  {
    "timeframe": "May 2025 – Aug 2025",
    "link": "https://nevara.ai/",
    "title": "Machine Learning Engineer Intern",
    "subtitle": "Nevara",
    "para": "Led a team of 5 interns and delivered 4/4 product milestones on time. Architected and deployed an AI-powered sales coaching platform on AWS using FastAPI microservices with Supabase. Built LLM pipelines (prompt engineering, input compression, RAG, lightweight agents) with a feedback loop from user responses, reducing sales coach workload by ~90% (10 hours to 1 hour) via automated note generation and multi-call report synthesis.",
    "tech": ["AWS", "FastAPI", "Supabase", "Python", "LLMs", "Prompt engineering", "RAG", "Agents", "Microservices"]
  },
  {
      "timeframe": "Jan 2025 – Present",
      "link": "https://engineering.nyu.edu/academics/programs/nyu-tandon-bridge",
      "title": "Graduate Teaching Assistant",
      "subtitle": "New York University",
      "para": "The NYU Tandon Bridge program is a fast-paced 6-month long program that equips students with the fundamentals of computer science. My tasks include teaching and mentoring students on C++ programming, data structures and algorithms, operating systems, among others. I'm also in charge of grading exams for cohorts of 100+ students.",
      "tech": ["C++", "Data structures", "Algorithms", "Operating Systems", "Discrete Math"]
    },
    {
      "timeframe": "Jan 2022 – Sep 2024",
      "link": "https://www.bya.cl/",
      "title": "Associate Research Consultant",
      "subtitle": "GBA Economic Consulting",
      "para": "Conducted quantitative research for 15+ high-impact consulting projects across energy, telecom, transportation, intellectual property, and antitrust. Delivered presentations in English and Spanish to diverse stakeholders including C-level executives. Enabled clients savings of over $10M through data-driven insights. Top clients included Mastercard, LATAM Airlines, Engie, among others.",
      "tech": ["Python", "R", "Excel", "PowerPoint"]
    },
    {
      "timeframe": "Jul 2019 – Dec 2021",
      "link": "https://www.mineduc.cl/",
      "title": "Data Scientist",
      "subtitle": "Ministry of Education, Government of Chile",
      "para": "Led a data science team developing a student dropout prediction model integrating large datasets from multiple government departments. Boosted prediction accuracy from ~50% to over 80%, directly impacting national policy responses during the COVID-19 pandemic.",
      "tech": ["Python", "Pandas", "Scikit-learn", "PostgreSQL", "STATA", "R"]
    },
    {
      "timeframe": "Mar 2018 – Aug 2018",
      "link": "https://www.mintrab.gob.cl/",
      "title": "Research Intern",
      "subtitle": "Ministry of Labor, Government of Chile",
      "para": "Enhanced national unemployment insurance simulations by upgrading labor market models and cash flow tracking for retirement benefits. Used econometric and statistical modeling techniques on large-scale administrative datasets, coordinating batched jobs on an in-house GPU server.",
      "tech": ["R", "Python", "Econometrics", "SQL", "GPU cluster"]
    }
  ]  